PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_autanalog.c
/***************************************************************************//**
* \file cy_autanalog.c
* \version 2.0
*
* \brief
* Provides an API definition of the Autonomous Analog driver.
*
********************************************************************************
* \copyright
* Copyright 2022-2025 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/
#include <string.h>
#include "cy_autanalog.h"

#ifdef CY_IP_MXS22LPPASS

#include "cy_systrimm.h"

/* Helper macros for range validation */
#define AUTANALOG_PRB_IDX(value)                                    ((value) < CY_AUTANALOG_PRB_NUM)
/* Validation macros for CLOCK_DIV registers */
#define AUTANALOG_CLOCK_DIV_PRIO_HS_DEFAULT                         (19UL)
#define AUTANALOG_CLOCK_DIV(value)                                  ((value) <= INFRA_CLOCK_PTC_LP_DIV_DIV_VAL_Msk)
/* Validation macros for PRIO_CFG register */
#define AUTANALOG_PRIO_CFG_DEFAULT                                  (0UL)
/* Validation macros for LPOSC register */
#define AUTANALOG_LPOSC_CFG_DEFAULT                                 (0x80000000U) /* ENABLE, ALWAYS_ON */
/* Validation macros for AREF register */
#define AUTANALOG_AREF_CTRL_DEFAULT                                 (0UL)
#define AUTANALOG_AREF_CTRL(value)                                  ((value) <= CY_AUTANALOG_VREF_EXT)
/* Validation macros for PRB register */
#define AUTANALOG_PRB_VREF_CTRL_CFG(value)                          ((value) <= CY_AUTANALOG_PRB_VDDA)
#define AUTANALOG_PRB_VREF_CTRL_VAL(value)                          ((value) <= CY_AUTANALOG_PRB_TAP_15)

/* Validation macros for State Transition Table registers of AC */
#define AUTANALOG_STT_AC_CFG1_CNT(value)                             ((value) <= 0x0FFFUL)
#define AUTANALOG_STT_AC_CFG1_ACTION(value)                          ((value) <= CY_AUTANALOG_STT_AC_ACTION_BRANCH_IF_FALSE_CLR)
#define AUTANALOG_STT_AC_CFG1_COND(value)                            ((value) <= CY_AUTANALOG_STT_AC_CONDITION_DAC1_STROBE)
#define AUTANALOG_STT_AC_CFG1_BR_ADDR(value)                         ((value) < CY_AUTANALOG_STATE_TRANSITION_TABLE_STATES_NUM)
/* Validation macros for State Transition Table registers of CTB */
#define AUTANALOG_STT_CTB_CFG(value)                                 ((value) <  CY_AUTANALOG_CTB_DYN_CFG_MAX)
#define AUTANALOG_STT_CTB_GAIN(value)                                ((value) <= CY_AUTANALOG_STT_CTB_OA_GAIN_32_00)
/* Validation macros for State Transition Table registers of PTComp */
#define AUTANALOG_STT_PTCOMP_CFG(value)                              ((value) <  CY_AUTANALOG_PTCOMP_DYN_CFG_MAX)
/* Validation macros for State Transition Table registers of DAC */
#define AUTANALOG_STT_DAC_CHANNEL(value)                             ((value) <=  CY_AUTANALOG_DAC_CH_CFG_NUM)
#define AUTANALOG_STT_DAC_DIRECTION(value)                           ((value) <= CY_AUTANALOG_DAC_DIRECTION_REVERSE)
/* Validation macros for State Transition Table registers of SAR */
#define AUTANALOG_STT_SAR_STATE(value)                               ((value) <= ACTRLR_TTCFG_TT_CFG3_SAR_ENTRY_ADDR_Msk)
#if !defined (CY_AUTANALOG_TRIMM_DISABLE)
    /* Trimming block die temp */
    #define AUTANALOG_RRAM_TRIMM_START_IDX_DIE_TEMP                      (1UL)
    /* Trimming block CTB0 */
    #define AUTANALOG_RRAM_TRIMM_START_IDX_CTB0_10X_RMP                  (11UL)
    #define AUTANALOG_RRAM_TRIMM_START_IDX_CTB0_1X_RMP                   (18UL)
    /* Trimming block CTB1 */
    #define AUTANALOG_RRAM_TRIMM_START_IDX_CTB1_10X_RMP                  (25UL)
    #define AUTANALOG_RRAM_TRIMM_START_IDX_CTB1_1X_RMP                   (32UL)
    /* Trimming block CTB0, OA0 */
    #define AUTANALOG_RRAM_TRIMM_START_IDX_CTB0_OA0_10X                  (5UL)
    #define AUTANALOG_RRAM_TRIMM_START_IDX_CTB0_OA0_1X                   (8UL)
    /* Trimming block CTB0, OA1 */
    #define AUTANALOG_RRAM_TRIMM_START_IDX_CTB0_OA1_10X                  (8UL)
    #define AUTANALOG_RRAM_TRIMM_START_IDX_CTB0_OA1_1X                   (15UL)
    /* Trimming block CTB1, OA0 */
    #define AUTANALOG_RRAM_TRIMM_START_IDX_CTB1_OA0_10X                  (19UL)
    #define AUTANALOG_RRAM_TRIMM_START_IDX_CTB1_OA0_1X                   (22UL)
    /* Trimming block CTB1, OA1 */
    #define AUTANALOG_RRAM_TRIMM_START_IDX_CTB1_OA1_10X                  (22UL)
    #define AUTANALOG_RRAM_TRIMM_START_IDX_CTB1_OA1_1X                   (29UL)
    /* Trimming block PTC */
    #define AUTANALOG_RRAM_TRIMM_START_IDX_PTC                           (33UL)
    /* Trimming block DAC0 */
    #define AUTANALOG_RRAM_TRIMM_START_IDX_DAC0                          (35UL)
    /* Trimming block DAC1 */
    #define AUTANALOG_RRAM_TRIMM_START_IDX_DAC1                          (45UL)
    /* Trimming block ADC, HS */
    #define AUTANALOG_RRAM_TRIMM_START_IDX_ADC_HS_CALCTRL                (55UL)
    /* Trimming block ADC, LP */
    #define AUTANALOG_RRAM_TRIMM_START_IDX_ADC_LP_CALCTRL                (68UL)
    /* Trimming block ADC */
    #define AUTANALOG_RRAM_TRIMM_START_IDX_ADC                           (72UL)
    /* Trimming block INFRA, LPOSC */
    #define AUTANALOG_RRAM_TRIMM_START_IDX_LPOSC                         (79UL)
    /* Trimming block INFRA, AREF */
    #define AUTANALOG_RRAM_TRIMM_START_IDX_AREF                          (80UL)
#endif

/* Forward declarations */
#if !defined (CY_AUTANALOG_TRIMM_DISABLE)
    static cy_en_autanalog_status_t Analog_LoadTrimmValues(const cy_stc_autanalog_cfg_t * analogCfg);
#endif
static void Analog_UpdateTimerTable_AC(uint8_t stateIdx, const cy_stc_autanalog_stt_t * stateTransitionTable, uint8_t targetState);
#if !defined (CY_AUTANALOG_PRB_DISABLE)
    static void Analog_UpdateTimerTable_PRB(uint8_t stateIdx, const cy_stc_autanalog_stt_t * stateTransitionTable, uint8_t targetState);
#endif
#if defined (CY_IP_MXS22LPPASS_CTB) && !defined (CY_AUTANALOG_CTB_DISABLE)
    static void Analog_UpdateTimerTable_CTB(uint8_t stateIdx, const cy_stc_autanalog_stt_t * stateTransitionTable, uint8_t targetState);
#endif
#if defined (CY_IP_MXS22LPPASS_PTC) && !defined (CY_AUTANALOG_PTC_DISABLE)
    static void Analog_UpdateTimerTable_PTC(uint8_t stateIdx, const cy_stc_autanalog_stt_t * stateTransitionTable, uint8_t targetState);
#endif
#if defined (CY_IP_MXS22LPPASS_DAC) && !defined (CY_AUTANALOG_DAC_DISABLE)
    static void Analog_UpdateTimerTable_DAC(uint8_t stateIdx, const cy_stc_autanalog_stt_t * stateTransitionTable, uint8_t targetState);
#endif
#if defined (CY_IP_MXS22LPPASS_SAR) && !defined (CY_AUTANALOG_SAR_DISABLE)
    static void Analog_UpdateTimerTable_SAR(uint8_t stateIdx, const cy_stc_autanalog_stt_t * stateTransitionTable, uint8_t targetState);
#endif


#if !((CY_IP_MXS22LPPASS_VERSION == 1UL) && (CY_IP_MXS22LPPASS_VERSION_MINOR == 0UL))
    void Cy_AutAnalog_AdvPowerControl(bool sleepModeAC, bool lpOscDutyCycle, bool sarLpCorePowerCycle)
#else
    void Cy_AutAnalog_AdvPowerControl(bool sleepModeAC, bool lpOscDutyCycle)
#endif
{
    /* Update AC CFG register */
    CY_REG32_CLR_SET(AUTANALOG_AC_CFG(ACTRLR_BASE), ACTRLR_CFG_SLEEP_MODE, sleepModeAC);

    /* Update LPOSC CFG register */
    CY_REG32_CLR_SET(AUTANALOG_INFRA_LPOSC_CFG(INFRA_BASE), INFRA_LPOSC_CFG_MODE, lpOscDutyCycle);

    /* Update SAR CTRL register */
#if !((CY_IP_MXS22LPPASS_VERSION == 1UL) && (CY_IP_MXS22LPPASS_VERSION_MINOR == 0UL))
#ifdef SAR_BASE
    CY_REG32_CLR_SET(AUTANALOG_SAR_CTRL(SAR_BASE), SAR_STA_CTRL_LP_SAR_PWR_MODE, sarLpCorePowerCycle);
#else
    (void) sarLpCorePowerCycle;
#endif
#endif
}


void Cy_AutAnalog_Clear(void)
{
    /* Disable the digital switched supply (clear content in registers and SRAM) */
    CY_REG32_CLR_SET(AUTANALOG_AC_CFG(ACTRLR_BASE), ACTRLR_CFG_DISABLE_MODE, 0x1U);

    /* Unregister SysPm callback */
    (void)Cy_SysPm_UnregisterCallback(&deepSleepCallback);
}


uint32_t Cy_AutAnalog_Init(const cy_stc_autanalog_t * cfgAndStates)
{
    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.3', 'Review shows that type conversion from enum to uint32_t does not have any negative drawbacks');
    uint32_t retVal = CY_AUTANALOG_BAD_PARAM;

    if (NULL != cfgAndStates)
    {
        /* Loads static and dynamic pairs of the configuration into the MMIO */
        retVal = Cy_AutAnalog_LoadConfig(cfgAndStates->configuration);

        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.4', 'Review shows that comparison of enum with uint32_t does not have any negative drawbacks');
        if (CY_AUTANALOG_SUCCESS == retVal)
        {
            /* Loads the entire content of the State Transition Table into the MMIO */
            CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.3', 'Review shows that assignment of enum to uint32_t does not have any negative drawbacks');
            retVal = Cy_AutAnalog_LoadStateTransitionTable(cfgAndStates->numSttEntries, cfgAndStates->stateTransitionTable);
        }
    }

    return retVal;
}


