PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_autanalog.c
void Cy_AutAnalog_Disable(void)
{
    /* Disable the digital switched supply (clear content in registers and SRAM) */
    CY_REG32_CLR_SET(AUTANALOG_AC_CFG(ACTRLR_BASE), ACTRLR_CFG_DISABLE_MODE, 0x1U);

    /* Disable the Autonomous Analog power domain */
    AUTANALOG_AC_CTRL(ACTRLR_BASE) = _VAL2FLD(ACTRLR_CTRL_ENABLED, 0x0U);

    /* Unregister SysPm callback */
    (void)Cy_SysPm_UnregisterCallback(&deepSleepCallback);
}


void Cy_AutAnalog_Enable(void)
{
    /* Enable the digital switched supply */
    CY_REG32_CLR_SET(AUTANALOG_AC_CFG(ACTRLR_BASE), ACTRLR_CFG_DISABLE_MODE, 0x0U);

    /* Enable the Autonomous Analog power domain */
    AUTANALOG_AC_CTRL(ACTRLR_BASE) = _VAL2FLD(ACTRLR_CTRL_ENABLED, 0x1U);
}


uint32_t Cy_AutAnalog_LoadConfig(const cy_stc_autanalog_cfg_t * analogCfg)
{
    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.3', 'Review shows that type conversion from enum to uint32_t does not have any negative drawbacks');
    uint32_t retVal = CY_AUTANALOG_BAD_PARAM;

    if (NULL != analogCfg)
    {
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.3', 'Review shows that type conversion from enum to uint32_t does not have any negative drawbacks');
        retVal = CY_AUTANALOG_ENABLE_ERR;

        uint8_t cfgIdx;
        uint32_t regVal;

        /* Enable IP block for further operation */
        Cy_AutAnalog_Enable();

        /* Delay for powering of the LPPASS, 10uS maximum */
        Cy_SysLib_DelayUs(10U);

        /* Get acknowledge about readiness of the LPPASS for further operation */
        regVal = _FLD2VAL(ACTRLR_PWR_STATUS_SW_OK, AUTANALOG_AC_PWR_STATUS(ACTRLR_BASE));
        if (regVal != 0U)
        {
            CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.3', 'Review shows that type conversion from enum to uint32_t does not have any negative drawbacks');
            retVal = CY_AUTANALOG_SUCCESS;

            /* Delay for startup of IZTAT current reference, 200uS maximum */
            Cy_SysLib_DelayUs(200U);

            /* Update LPOSC register */
            AUTANALOG_INFRA_LPOSC_CFG(INFRA_BASE) = AUTANALOG_LPOSC_CFG_DEFAULT;

            /* Validate enumerations for CLOCK_PRIO_HS_DIV register */
            CY_ASSERT_L3(AUTANALOG_CLOCK_DIV(AUTANALOG_CLOCK_DIV_PRIO_HS_DEFAULT));
            /* Update CLOCK_PRIO_HS_DIV register */
            AUTANALOG_INFRA_CLOCK_PRIO_HS_DIV(INFRA_BASE) = AUTANALOG_CLOCK_DIV_PRIO_HS_DEFAULT;

            /* Update registers PRIO_CFG[] with initial values for the delay counter */
            AUTANALOG_INFRA_PRIO_CFG(INFRA_BASE, CY_AUTANALOG_PRIORITY_GROUP0) = (uint32_t)CY_AUTANALOG_PRIORITY_GROUP0_CNT;
            AUTANALOG_INFRA_PRIO_CFG(INFRA_BASE, CY_AUTANALOG_PRIORITY_GROUP1) = (uint32_t)CY_AUTANALOG_PRIORITY_GROUP1_CNT;
            AUTANALOG_INFRA_PRIO_CFG(INFRA_BASE, CY_AUTANALOG_PRIORITY_GROUP2) = (uint32_t)CY_AUTANALOG_PRIORITY_GROUP2_CNT;
            AUTANALOG_INFRA_PRIO_CFG(INFRA_BASE, CY_AUTANALOG_PRIORITY_GROUP3) = (uint32_t)CY_AUTANALOG_PRIORITY_GROUP3_CNT;

            /* Update AREF register */
            AUTANALOG_INFRA_AREF_CTRL(INFRA_BASE) = AUTANALOG_AREF_CTRL_DEFAULT;

            /* Configure PRBs */
#if !defined (CY_AUTANALOG_PRB_DISABLE)
            if (NULL != analogCfg->prb)
            {
                for (cfgIdx = 0U; cfgIdx < CY_AUTANALOG_PRB_NUM; cfgIdx++)
                {
                    CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.1', 1, 'Review shows that usage type enum as operand to the arithmetic operator OR does not have any negative drawbacks');
                    CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.4', 1, 'Review shows that interpretation of type enum as uint32_t does not have any negative drawbacks');
                    retVal |= Cy_AutAnalog_PRB_LoadConfig(cfgIdx, analogCfg->prb);
                    CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.4');
                    CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.1');
                }
            }
#endif

            /* Configure CTBs */
#if defined (CY_IP_MXS22LPPASS_CTB) && !defined (CY_AUTANALOG_CTB_DISABLE)
            for (cfgIdx = 0U; cfgIdx < PASS_NR_CTBLS; cfgIdx++)
            {
#ifndef CTBL0_BASE
                if (0U == cfgIdx)
                {
                    continue;
                }
#endif
#ifndef CTBL1_BASE
                if (1U == cfgIdx)
                {
                    continue;
                }
#endif
                if (NULL != analogCfg->ctb[cfgIdx])
                {
                    CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.1', 1, 'Review shows that usage type enum as operand to the arithmetic operator OR does not have any negative drawbacks');
                    CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.4', 1, 'Review shows that interpretation of type enum as uint32_t does not have any negative drawbacks');
                    retVal |= Cy_AutAnalog_CTB_LoadConfig(cfgIdx, analogCfg->ctb[cfgIdx]);
                    CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.4');
                    CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.1');
                }
            }
#endif

            /* Configure PTC */
#if defined (CY_IP_MXS22LPPASS_PTC) && !defined (CY_AUTANALOG_PTC_DISABLE)
            for (cfgIdx = 0U; cfgIdx < PASS_NR_PTCS; cfgIdx++)
            {
#ifndef PTC_BASE
                break;
#endif
                if (NULL != analogCfg->ptcomp[cfgIdx])
                {
                    CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.1', 1, 'Review shows that usage type enum as operand to the arithmetic operator OR does not have any negative drawbacks');
                    CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.4', 1, 'Review shows that interpretation of type enum as uint32_t does not have any negative drawbacks');
                    retVal |= Cy_AutAnalog_PTComp_LoadConfig(cfgIdx, analogCfg->ptcomp[cfgIdx]);
                    CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.4');
                    CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.1');
                }
            }
#endif

            /* Configure DACs */
#if defined (CY_IP_MXS22LPPASS_DAC) && !defined (CY_AUTANALOG_DAC_DISABLE)
            for (cfgIdx = 0U; cfgIdx < PASS_NR_DACS; cfgIdx++)
            {
#ifndef DAC0_BASE
                if (0U == cfgIdx)
                {
                    continue;
                }
#endif
#ifndef DAC1_BASE
                if (1U == cfgIdx)
                {
                    continue;
                }
#endif
                if (NULL != analogCfg->dac[cfgIdx])
                {
                    CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.1', 1, 'Review shows that usage type enum as operand to the arithmetic operator OR does not have any negative drawbacks');
                    CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.4', 1, 'Review shows that interpretation of type enum as uint32_t does not have any negative drawbacks');
                    retVal |= Cy_AutAnalog_DAC_LoadConfig(cfgIdx, analogCfg->dac[cfgIdx]);
                    CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.4');
                    CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.1');
                }
            }
#endif

            /* Configure SAR */
#if defined (CY_IP_MXS22LPPASS_SAR) && !defined (CY_AUTANALOG_SAR_DISABLE)
            for (cfgIdx = 0U; cfgIdx < PASS_NR_SARS; cfgIdx++)
            {
#ifndef SAR_BASE
                break;
#endif
                if (NULL != analogCfg->sar[cfgIdx])
                {
                    CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.1', 1, 'Review shows that usage type enum as operand to the arithmetic operator OR does not have any negative drawbacks');
                    CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.4', 1, 'Review shows that interpretation of type enum as uint32_t does not have any negative drawbacks');
                    retVal |= Cy_AutAnalog_SAR_LoadConfig(cfgIdx, analogCfg->sar[cfgIdx]);
                    CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.4');
                    CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.1');
                }
            }
#endif

            /* Configure AC */
            CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.1', 1, 'Review shows that usage type enum as operand to the arithmetic operator OR does not have any negative drawbacks');
            CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.4', 1, 'Review shows that interpretation of type enum as uint32_t does not have any negative drawbacks');
            retVal |= Cy_AutAnalog_AC_LoadConfig(analogCfg->ac);
            CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.4');
            CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.1');
#if !defined (CY_AUTANALOG_TRIMM_DISABLE)
            /* Read and apply trimming values for the LPPASS subsystems */
            CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.1', 1, 'Review shows that usage type enum as operand to the arithmetic operator OR does not have any negative drawbacks');
            CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.4', 1, 'Review shows that interpretation of type enum as uint32_t does not have any negative drawbacks');
            retVal |= Analog_LoadTrimmValues(analogCfg);
            CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.4');
            CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.1');
#endif
            /* Check the need for start-up/settling delays according to the configuration provided */
            for (int32_t i = (int32_t)CY_AUTANALOG_PRIORITY_ENABLER_NUM - 1; i >= 0; i--)
            {
                /* Check for assignment of any subsystem in the particular delay group */
                if (0U == (AUTANALOG_INFRA_PRIO_CFG(INFRA_BASE, (uint32_t)i) & 0x0001FF00UL)) /* Mask for all subsystems */
                {
                    /* Delete unnecessary delay for empty group */
                    AUTANALOG_INFRA_PRIO_CFG(INFRA_BASE, (uint32_t)i) = 0U;
                }
                else
                {
                    /* Stop at the first occupied group counted from the end */
                    break;
                }
            }
        }
    }

    return retVal;
}


cy_en_autanalog_status_t Cy_AutAnalog_LoadStateTransitionTable(uint8_t numEntries, const cy_stc_autanalog_stt_t * stateTransitionTable)
{
    cy_en_autanalog_status_t retVal = CY_AUTANALOG_BAD_PARAM;

    if ((CY_AUTANALOG_STATE_TRANSITION_TABLE_STATES_NUM >= numEntries) && (NULL != stateTransitionTable))
    {
        uint8_t stateIdx;

