PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_autanalog.c
        /* Resets to default the MMIO registers that contain the State Transition table */
        for (stateIdx = 0U; stateIdx < CY_AUTANALOG_STATE_TRANSITION_TABLE_STATES_NUM; stateIdx++)
        {
            AUTANALOG_AC_TT_CFG0(ACTRLR_BASE, stateIdx) = 0x0UL;
            AUTANALOG_AC_TT_CFG1(ACTRLR_BASE, stateIdx) = 0x0UL;
            AUTANALOG_AC_TT_CFG2(ACTRLR_BASE, stateIdx) = 0x0UL;
            AUTANALOG_AC_TT_CFG3(ACTRLR_BASE, stateIdx) = 0x0UL;
            AUTANALOG_AC_TT_CFG4(ACTRLR_BASE, stateIdx) = 0x0UL;
        }

        /* Updates the MMIO registers that contain the State Transition table */
        retVal = Cy_AutAnalog_UpdateStateTransitionTable(numEntries, stateTransitionTable, 0U);
    }

    return retVal;
}


cy_en_autanalog_status_t Cy_AutAnalog_UpdateStateTransitionTable(uint8_t numEntries, const cy_stc_autanalog_stt_t * stateTransitionTable, uint8_t startState)
{
    cy_en_autanalog_status_t retVal = CY_AUTANALOG_BAD_PARAM;

    /* Checks the valid ranges for the STT update */
    if ((numEntries > 0U) && (CY_AUTANALOG_STATE_TRANSITION_TABLE_STATES_NUM - startState >= numEntries) && (NULL != stateTransitionTable))
    {
        uint8_t stateIdx;

        for (stateIdx = 0U; stateIdx < numEntries; stateIdx++)
        {
            /* Updates the section of the STT related to the AC */
            Analog_UpdateTimerTable_AC(stateIdx, stateTransitionTable, startState);

#if !defined (CY_AUTANALOG_PRB_DISABLE)
            /* Updates the section of STT related to the PRB */
            Analog_UpdateTimerTable_PRB(stateIdx, stateTransitionTable, startState);
#endif

#if defined (CY_IP_MXS22LPPASS_CTB) && !defined (CY_AUTANALOG_CTB_DISABLE)
            /* Updates the section of STT related to the CTB */
            Analog_UpdateTimerTable_CTB(stateIdx, stateTransitionTable, startState);
#endif

#if defined (CY_IP_MXS22LPPASS_PTC) && !defined (CY_AUTANALOG_PTC_DISABLE)
            /* Updates the section of STT related to the PTComp */
            Analog_UpdateTimerTable_PTC(stateIdx, stateTransitionTable, startState);
#endif

#if defined (CY_IP_MXS22LPPASS_DAC) && !defined (CY_AUTANALOG_DAC_DISABLE)
            /* Updates the section of STT related to the DAC */
            Analog_UpdateTimerTable_DAC(stateIdx, stateTransitionTable, startState);
#endif

#if defined (CY_IP_MXS22LPPASS_SAR) && !defined (CY_AUTANALOG_SAR_DISABLE)
            /* Updates the section of STT related to the SAR ADC */
            Analog_UpdateTimerTable_SAR(stateIdx, stateTransitionTable, startState);
#endif
            startState++;
        }

        retVal = CY_AUTANALOG_SUCCESS;
    }

    return retVal;
}


cy_en_autanalog_status_t Cy_AutAnalog_PRB_LoadConfig(uint8_t prbIdx, const cy_stc_autanalog_prb_t * prbCfg)
{
    cy_en_autanalog_status_t result = CY_AUTANALOG_PRB_BAD_PARAM;
    uint32_t regVal;

    if ((CY_AUTANALOG_PRB_NUM > prbIdx) && (NULL != prbCfg))
    {
        if (NULL != prbCfg->prb[prbIdx])
        {
            /* Validate enumerations for PRB_VREF_CTRL register */
            CY_ASSERT_L1(AUTANALOG_PRB_VREF_CTRL_CFG(prbCfg->prb[prbIdx]->src));
            CY_ASSERT_L1(AUTANALOG_PRB_VREF_CTRL_VAL(prbCfg->prb[prbIdx]->tap));

            /* Define value for PRB_VREF_CTRL register */
            regVal = _VAL2FLD(INFRA_PRB_VREF_CTRL_CFG, prbCfg->prb[prbIdx]->src);
            regVal |= _VAL2FLD(INFRA_PRB_VREF_CTRL_VAL, prbCfg->prb[prbIdx]->tap);
            regVal |= _VAL2FLD(INFRA_PRB_VREF_CTRL_EN, prbCfg->prb[prbIdx]->enable);

            /* Update PRB_VREF_CTRL register */
            AUTANALOG_INFRA_PRB_VREF_CTRL(INFRA_BASE, prbIdx) = regVal;

            /* Start up delay depends on used Vref for the PRB: VDDA (150uS) or VBGR (100uS) */
            Cy_SysLib_DelayUs(prbCfg->prb[prbIdx]->src == CY_AUTANALOG_PRB_VDDA ? 150U : 100U);
        }

        result = CY_AUTANALOG_SUCCESS;
    }

    return result;
}


void Cy_AutAnalog_PRB_Write(uint8_t prbIdx, cy_en_autanalog_prb_tap_t tap)
{
    uint32_t regVal;

    /* Validate enumerations for PRB_VREF_CTRL register */
    CY_ASSERT_L1(AUTANALOG_PRB_IDX(prbIdx));
    CY_ASSERT_L1(AUTANALOG_PRB_VREF_CTRL_VAL(tap));

    /* Sets the value for PRB_VREF_CTRL register */
    regVal = AUTANALOG_INFRA_PRB_VREF_CTRL(INFRA_BASE, prbIdx);
    regVal &= ~INFRA_PRB_VREF_CTRL_VAL_Msk;
    regVal |= _VAL2FLD(INFRA_PRB_VREF_CTRL_VAL, tap);

    /* Updates the PRB_VREF_CTRL register */
    AUTANALOG_INFRA_PRB_VREF_CTRL(INFRA_BASE, prbIdx) = regVal;
}

#if !defined (CY_AUTANALOG_TRIMM_DISABLE)
/*******************************************************************************
* Function Name: Analog_LoadTrimmValues
****************************************************************************//**
*
* Used to load trimming values for Autonomous Analog from RRAM into MMIO.
*
* \param analogCfg
* The pointer to the structure containing configuration data
* for the entire Autonomous Analog.
*
* \return
* Status of operation, \ref cy_en_autanalog_status_t.
*
*******************************************************************************/
static cy_en_autanalog_status_t Analog_LoadTrimmValues(const cy_stc_autanalog_cfg_t * analogCfg)
{
    cy_en_autanalog_status_t result = CY_AUTANALOG_BAD_PARAM;

    if (NULL != analogCfg)
    {
        result = CY_AUTANALOG_TRIMM_ERR;

        uint32_t trimmData[TRIMM_SECTION_SIZE_BYTES / sizeof(int)];

        /* Read array of trimming constants */
        if (Cy_Trimm_ReadRRAMdata(TRIMM_SECTION_SIZE_BYTES, trimmData))
        {
            result = CY_AUTANALOG_SUCCESS;

            uint8_t idx;

            /* Die temperature */
            cyAutanalogTempMultiplierHS = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_DIE_TEMP];
            cyAutanalogTempOffsetHS     = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_DIE_TEMP + 1U];
            cyAutanalogTempMultiplierLP = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_DIE_TEMP + 2U];
            cyAutanalogTempOffsetLP     = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_DIE_TEMP + 3U];

#if defined (CY_IP_MXS22LPPASS_CTB) && !defined (CY_AUTANALOG_CTB_DISABLE)
            /* Check CTB configuration */
#if defined(CTBL0_BASE)
            uint8_t offset_CTB0_1X = 7U; /* Relative offset from CTB0_10X */
#endif
#if defined(CTBL1_BASE)
            uint8_t offset_CTB1_1X = 7U; /* Relative offset from CTB1_10X */
#endif

#if !((CY_IP_MXS22LPPASS_VERSION == 1UL) && (CY_IP_MXS22LPPASS_VERSION_MINOR == 0UL))
            /* Defines position and size of trim data in RRAM based on OpAmps power mode */
#define CTB_OA_PWR_HIGH_Pos              0UL
#define CTB_OA_PWR_HIGH_Msk              0xFFUL
#define CTB_OA_PWR_ULTRA_HIGH_Pos        8UL
#define CTB_OA_PWR_ULTRA_HIGH_Msk        0xFF00UL
#define CTB_OA_PWR_MEDIUM_Pos            16UL
#define CTB_OA_PWR_MEDIUM_Msk            0xFF0000UL
#endif

