PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_autanalog.c
#if defined(CTBL0_BASE)
            if (NULL != analogCfg->ctb[0U])
            {
                if ((NULL != analogCfg->ctb[0U]->ctbDynCfgArr) && (0U < analogCfg->ctb[0U]->ctbDynCfgNum))
                {
                    for (idx = 0U; idx < analogCfg->ctb[0U]->ctbDynCfgNum; idx++)
                    {
                        if (analogCfg->ctb[0U]->ctbDynCfgArr[idx].outToPin)
                        {
                            offset_CTB0_1X = 0U;
                            break;
                        }
                    }
                }
            }

#if ((CY_IP_MXS22LPPASS_VERSION == 1UL) && (CY_IP_MXS22LPPASS_VERSION_MINOR == 0UL))
            /* CTB0, OA0 */
            CTBL0->TRIM.OA0_OFFSET_TRIM       = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_CTB0_OA0_10X + offset_CTB0_1X];
            CTBL0->TRIM.OA0_SLOPE_OFFSET_TRIM = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_CTB0_OA0_10X + offset_CTB0_1X + 1U];

            /* CTB0, OA1 */
            CTBL0->TRIM.OA1_OFFSET_TRIM       = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_CTB0_OA1_10X + offset_CTB0_1X];
            CTBL0->TRIM.OA1_SLOPE_OFFSET_TRIM = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_CTB0_OA1_10X + offset_CTB0_1X + 1U];
#else
            /* CTB0, OA0 */
            uint32_t ctb0Oa0_OffsetTrim       = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_CTB0_OA0_10X + offset_CTB0_1X];
            uint32_t ctb0Oa0_SlopeTrim        = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_CTB0_OA0_10X + offset_CTB0_1X + 1U];

            /* CTB0, OA1 */
            uint32_t ctb0Oa1_OffsetTrim       = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_CTB0_OA1_10X + offset_CTB0_1X];
            uint32_t ctb0Oa1_SlopeTrim        = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_CTB0_OA1_10X + offset_CTB0_1X + 1U];

            if (NULL != analogCfg->ctb[0U])
            {
                if (NULL != analogCfg->ctb[0U]->ctbStaCfg)
                {
                    /* CTB0, OA0 */
                    if (analogCfg->ctb[0U]->ctbStaCfg->pwrOpamp0 == CY_AUTANALOG_CTB_OA_PWR_ULTRA_HIGH_RAIL)
                    {
                        CTBL0->TRIM.OA0_OFFSET_TRIM       = _FLD2VAL(CTB_OA_PWR_ULTRA_HIGH, ctb0Oa0_OffsetTrim);
                        CTBL0->TRIM.OA0_SLOPE_OFFSET_TRIM = _FLD2VAL(CTB_OA_PWR_ULTRA_HIGH, ctb0Oa0_SlopeTrim);
                    }
                    else if (analogCfg->ctb[0U]->ctbStaCfg->pwrOpamp0 == CY_AUTANALOG_CTB_OA_PWR_HIGH_RAIL)
                    {
                        CTBL0->TRIM.OA0_OFFSET_TRIM       = _FLD2VAL(CTB_OA_PWR_HIGH, ctb0Oa0_OffsetTrim);
                        CTBL0->TRIM.OA0_SLOPE_OFFSET_TRIM = _FLD2VAL(CTB_OA_PWR_HIGH, ctb0Oa0_SlopeTrim);
                    }
                    else
                    {
                        CTBL0->TRIM.OA0_OFFSET_TRIM       = _FLD2VAL(CTB_OA_PWR_MEDIUM, ctb0Oa0_OffsetTrim);
                        CTBL0->TRIM.OA0_SLOPE_OFFSET_TRIM = _FLD2VAL(CTB_OA_PWR_MEDIUM, ctb0Oa0_SlopeTrim);
                    }

                    /* CTB0, OA1 */
                    if (analogCfg->ctb[0U]->ctbStaCfg->pwrOpamp1 == CY_AUTANALOG_CTB_OA_PWR_ULTRA_HIGH_RAIL)
                    {
                        CTBL0->TRIM.OA1_OFFSET_TRIM       = _FLD2VAL(CTB_OA_PWR_ULTRA_HIGH, ctb0Oa1_OffsetTrim);
                        CTBL0->TRIM.OA1_SLOPE_OFFSET_TRIM = _FLD2VAL(CTB_OA_PWR_ULTRA_HIGH, ctb0Oa1_SlopeTrim);
                    }
                    else if (analogCfg->ctb[0U]->ctbStaCfg->pwrOpamp1 == CY_AUTANALOG_CTB_OA_PWR_HIGH_RAIL)
                    {
                        CTBL0->TRIM.OA1_OFFSET_TRIM       = _FLD2VAL(CTB_OA_PWR_HIGH, ctb0Oa1_OffsetTrim);
                        CTBL0->TRIM.OA1_SLOPE_OFFSET_TRIM = _FLD2VAL(CTB_OA_PWR_HIGH, ctb0Oa1_SlopeTrim);
                    }
                    else
                    {
                        CTBL0->TRIM.OA1_OFFSET_TRIM       = _FLD2VAL(CTB_OA_PWR_MEDIUM, ctb0Oa1_OffsetTrim);
                        CTBL0->TRIM.OA1_SLOPE_OFFSET_TRIM = _FLD2VAL(CTB_OA_PWR_MEDIUM, ctb0Oa1_SlopeTrim);
                    }
                }
            }
            else /* Default value */
            {
                /* CTB0, OA0 */
                CTBL0->TRIM.OA0_OFFSET_TRIM       = _FLD2VAL(CTB_OA_PWR_MEDIUM, ctb0Oa0_OffsetTrim);
                CTBL0->TRIM.OA0_SLOPE_OFFSET_TRIM = _FLD2VAL(CTB_OA_PWR_MEDIUM, ctb0Oa0_SlopeTrim);

                /* CTB0, OA1 */
                CTBL0->TRIM.OA1_OFFSET_TRIM       = _FLD2VAL(CTB_OA_PWR_MEDIUM, ctb0Oa1_OffsetTrim);
                CTBL0->TRIM.OA1_SLOPE_OFFSET_TRIM = _FLD2VAL(CTB_OA_PWR_MEDIUM, ctb0Oa1_SlopeTrim);
            }
#endif

            /* CTB0, RMR */
            CTBL0->TRIM.RMP_TRIM              = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_CTB0_10X_RMP + offset_CTB0_1X];
#endif /* CTBL0_BASE */

#if defined(CTBL1_BASE)
            if (NULL != analogCfg->ctb[1U])
            {
                if ((NULL != analogCfg->ctb[1U]->ctbDynCfgArr) && (0U < analogCfg->ctb[1U]->ctbDynCfgNum))
                {
                    for (idx = 0U; idx < analogCfg->ctb[1U]->ctbDynCfgNum; idx++)
                    {
                        if (analogCfg->ctb[1U]->ctbDynCfgArr[idx].outToPin)
                        {
                            offset_CTB1_1X = 0U;
                            break;
                        }
                    }
                }
            }

#if ((CY_IP_MXS22LPPASS_VERSION == 1UL) && (CY_IP_MXS22LPPASS_VERSION_MINOR == 0UL))
            /* CTB1, OA0 */
            CTBL1->TRIM.OA0_OFFSET_TRIM       = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_CTB1_OA0_10X + offset_CTB1_1X];
            CTBL1->TRIM.OA0_SLOPE_OFFSET_TRIM = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_CTB1_OA0_10X + offset_CTB1_1X + 1U];

            /* CTB1, OA1 */
            CTBL1->TRIM.OA1_OFFSET_TRIM       = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_CTB1_OA1_10X + offset_CTB1_1X];
            CTBL1->TRIM.OA1_SLOPE_OFFSET_TRIM = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_CTB1_OA1_10X + offset_CTB1_1X + 1U];
#else
            /* CTB1, OA0 */
            uint32_t ctb1Oa0_OffsetTrim       = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_CTB1_OA0_10X + offset_CTB1_1X];
            uint32_t ctb1Oa0_SlopeTrim        = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_CTB1_OA0_10X + offset_CTB1_1X + 1U];

