PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_autanalog.c
            /* CTB1, OA1 */
            uint32_t ctb1Oa1_OffsetTrim       = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_CTB1_OA1_10X + offset_CTB1_1X];
            uint32_t ctb1Oa1_SlopeTrim        = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_CTB1_OA1_10X + offset_CTB1_1X + 1U];

            if (NULL != analogCfg->ctb[1U])
            {
                if (NULL != analogCfg->ctb[1U]->ctbStaCfg)
                {
                    /* CTB1, OA0 */
                    if (analogCfg->ctb[1U]->ctbStaCfg->pwrOpamp0 == CY_AUTANALOG_CTB_OA_PWR_ULTRA_HIGH_RAIL)
                    {
                        CTBL1->TRIM.OA0_OFFSET_TRIM       = _FLD2VAL(CTB_OA_PWR_ULTRA_HIGH, ctb1Oa0_OffsetTrim);
                        CTBL1->TRIM.OA0_SLOPE_OFFSET_TRIM = _FLD2VAL(CTB_OA_PWR_ULTRA_HIGH, ctb1Oa0_SlopeTrim);
                    }
                    else if (analogCfg->ctb[1U]->ctbStaCfg->pwrOpamp0 == CY_AUTANALOG_CTB_OA_PWR_HIGH_RAIL)
                    {
                        CTBL1->TRIM.OA0_OFFSET_TRIM       = _FLD2VAL(CTB_OA_PWR_HIGH, ctb1Oa0_OffsetTrim);
                        CTBL1->TRIM.OA0_SLOPE_OFFSET_TRIM = _FLD2VAL(CTB_OA_PWR_HIGH, ctb1Oa0_SlopeTrim);
                    }
                    else
                    {
                        CTBL1->TRIM.OA0_OFFSET_TRIM       = _FLD2VAL(CTB_OA_PWR_MEDIUM, ctb1Oa0_OffsetTrim);
                        CTBL1->TRIM.OA0_SLOPE_OFFSET_TRIM = _FLD2VAL(CTB_OA_PWR_MEDIUM, ctb1Oa0_SlopeTrim);
                    }

                    /* CTB1, OA1 */
                    if (analogCfg->ctb[1U]->ctbStaCfg->pwrOpamp1 == CY_AUTANALOG_CTB_OA_PWR_ULTRA_HIGH_RAIL)
                    {
                        CTBL1->TRIM.OA1_OFFSET_TRIM       = _FLD2VAL(CTB_OA_PWR_ULTRA_HIGH, ctb1Oa1_OffsetTrim);
                        CTBL1->TRIM.OA1_SLOPE_OFFSET_TRIM = _FLD2VAL(CTB_OA_PWR_ULTRA_HIGH, ctb1Oa1_SlopeTrim);
                    }
                    else if (analogCfg->ctb[1U]->ctbStaCfg->pwrOpamp1 == CY_AUTANALOG_CTB_OA_PWR_HIGH_RAIL)
                    {
                        CTBL1->TRIM.OA1_OFFSET_TRIM       = _FLD2VAL(CTB_OA_PWR_HIGH, ctb1Oa1_OffsetTrim);
                        CTBL1->TRIM.OA1_SLOPE_OFFSET_TRIM = _FLD2VAL(CTB_OA_PWR_HIGH, ctb1Oa1_SlopeTrim);
                    }
                    else
                    {
                        CTBL1->TRIM.OA1_OFFSET_TRIM       = _FLD2VAL(CTB_OA_PWR_MEDIUM, ctb1Oa1_OffsetTrim);
                        CTBL1->TRIM.OA1_SLOPE_OFFSET_TRIM = _FLD2VAL(CTB_OA_PWR_MEDIUM, ctb1Oa1_SlopeTrim);
                    }
                }
            }
            else /* Default value */
            {
                /* CTB1, OA0 */
                CTBL1->TRIM.OA0_OFFSET_TRIM       = _FLD2VAL(CTB_OA_PWR_MEDIUM, ctb1Oa0_OffsetTrim);
                CTBL1->TRIM.OA0_SLOPE_OFFSET_TRIM = _FLD2VAL(CTB_OA_PWR_MEDIUM, ctb1Oa0_SlopeTrim);

                /* CTB1, OA1 */
                CTBL1->TRIM.OA1_OFFSET_TRIM       = _FLD2VAL(CTB_OA_PWR_MEDIUM, ctb1Oa1_OffsetTrim);
                CTBL1->TRIM.OA1_SLOPE_OFFSET_TRIM = _FLD2VAL(CTB_OA_PWR_MEDIUM, ctb1Oa1_SlopeTrim);
            }
#endif

            /* CTB1, RMR */
            CTBL1->TRIM.RMP_TRIM              = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_CTB1_10X_RMP + offset_CTB1_1X];
#endif /* CTBL1_BASE */
#endif /* CY_IP_MXS22LPPASS_CTB */

#if defined (CY_IP_MXS22LPPASS_PTC) && !defined (CY_AUTANALOG_PTC_DISABLE)
#if defined(PTC_BASE)
            /* PTC */
            PTC->TRIM.CMP0_OFFSET_TRIM = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_PTC];
            PTC->TRIM.CMP1_OFFSET_TRIM = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_PTC + 1U];
#endif /* PTC_BASE */
#endif /* CY_IP_MXS22LPPASS_PTC */

#if defined (CY_IP_MXS22LPPASS_DAC) && !defined (CY_AUTANALOG_DAC_DISABLE)
#if defined(DAC0_BASE)
            /* DAC0 */
            DAC0->TRIM.REFBUF_OFFSET_TRIM           = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_DAC0];
            DAC0->TRIM.REFBUF_SLOPE_OFFSET_TRIM     = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_DAC0 + 1U];
            DAC0->TRIM.REFBUF_COMP_TRIM             = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_DAC0 + 2U];
            DAC0->TRIM.OUTBUF_OFFSET_TRIM[0U]       = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_DAC0 + 3U];
            DAC0->TRIM.OUTBUF_OFFSET_TRIM[1U]       = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_DAC0 + 4U];
            DAC0->TRIM.OUTBUF_SLOPE_OFFSET_TRIM[0U] = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_DAC0 + 5U];
            DAC0->TRIM.OUTBUF_SLOPE_OFFSET_TRIM[1U] = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_DAC0 + 6U];
            DAC0->TRIM.OUTBUF_COMP_TRIM[0U]         = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_DAC0 + 7U];
            DAC0->TRIM.OUTBUF_COMP_TRIM[1U]         = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_DAC0 + 8U];
            DAC0->TRIM.RMP_TRIM                     = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_DAC0 + 9U];
#endif /* DAC0_BASE */

#if defined(DAC1_BASE)
            /* DAC1 */
            DAC1->TRIM.REFBUF_OFFSET_TRIM           = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_DAC1];
            DAC1->TRIM.REFBUF_SLOPE_OFFSET_TRIM     = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_DAC1 + 1U];
            DAC1->TRIM.REFBUF_COMP_TRIM             = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_DAC1 + 2U];
            DAC1->TRIM.OUTBUF_OFFSET_TRIM[0U]       = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_DAC1 + 3U];
            DAC1->TRIM.OUTBUF_OFFSET_TRIM[1U]       = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_DAC1 + 4U];
            DAC1->TRIM.OUTBUF_SLOPE_OFFSET_TRIM[0U] = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_DAC1 + 5U];
            DAC1->TRIM.OUTBUF_SLOPE_OFFSET_TRIM[1U] = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_DAC1 + 6U];
            DAC1->TRIM.OUTBUF_COMP_TRIM[0U]         = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_DAC1 + 7U];
            DAC1->TRIM.OUTBUF_COMP_TRIM[1U]         = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_DAC1 + 8U];
            DAC1->TRIM.RMP_TRIM                     = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_DAC1 + 9U];
#endif /* DAC1_BASE */
#endif /* CY_IP_MXS22LPPASS_DAC */

#if defined (CY_IP_MXS22LPPASS_SAR) && !defined (CY_AUTANALOG_SAR_DISABLE)
#if defined(SAR_BASE)
            /* SAR, HS */
            SAR->HS_CAL_MEM.CALCTRL     = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_ADC_HS_CALCTRL];
            SAR->HS_CAL_MEM.CONVCTRL    = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_ADC_HS_CALCTRL + 1U];
            SAR->HS_CAL_MEM.ADFTMUX     = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_ADC_HS_CALCTRL + 2U];
            for (idx = 0U; idx < 10U; idx++)
            {
                SAR->HS_CAL_MEM.CALMEM0[idx] = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_ADC_HS_CALCTRL + 3U + idx];
            }

            /* SAR, LP */
            SAR->LP_CAL_MEM.CALCTRL     = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_ADC_LP_CALCTRL];
            SAR->LP_CAL_MEM.CONVCTRL    = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_ADC_LP_CALCTRL + 1U];
            SAR->LP_CAL_MEM.ADFTMUX     = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_ADC_LP_CALCTRL + 2U];
            SAR->LP_CAL_MEM.CALMEM0     = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_ADC_LP_CALCTRL + 3U];

