PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_autanalog.c
            /* SAR, TRIM */
            SAR->TRIM.BUF0_OFFSET_TRIM       = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_ADC];
            SAR->TRIM.BUF0_SLOPE_OFFSET_TRIM = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_ADC + 1U];
            SAR->TRIM.BUF0_COMP_TRIM         = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_ADC + 2U];
            SAR->TRIM.BUF1_OFFSET_TRIM       = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_ADC + 3U];
            SAR->TRIM.BUF1_SLOPE_OFFSET_TRIM = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_ADC + 4U];
            SAR->TRIM.BUF1_COMP_TRIM         = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_ADC + 5U];
            SAR->TRIM.RMP_TRIM               = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_ADC + 6U];
#endif /* SAR_BASE */
#endif /* CY_IP_MXS22LPPASS_SAR */

            /* INFRA, LPOSC */
            INFRA->LPOSC.TRIM      = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_LPOSC];

            /* INFRA, AREF */
            INFRA->AREF.VREF_TRIM0  = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_AREF];
            INFRA->AREF.VREF_TRIM1  = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_AREF + 1U];
            INFRA->AREF.VREF_TRIM2  = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_AREF + 2U];
            INFRA->AREF.VREF_TRIM3  = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_AREF + 3U];
            INFRA->AREF.IZTAT_TRIM0 = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_AREF + 4U];
            INFRA->AREF.IPTAT_TRIM0 = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_AREF + 5U];
            INFRA->AREF.IPTAT_TRIM1 = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_AREF + 6U];
            INFRA->AREF.ICTAT_TRIM0 = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_AREF + 7U];
            INFRA->AREF.ICTAT_TRIM1 = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_AREF + 8U];
            INFRA->AREF.ICTAT_TRIM2 = trimmData[AUTANALOG_RRAM_TRIMM_START_IDX_AREF + 9U];
        }
    }

    return result;
}
#endif

/*******************************************************************************
* Function Name: Analog_UpdateTimerTable_AC
****************************************************************************//**
*
* Used to update a particular state in the State Transition Table for the AC subsystem.
*
* \param stateIdx
* Defines the state in the State Transition Table to update the AC subsystem.
*
* \param stateTransitionTable
* Pointer to array containing new set of configuration data for State Transition Table,
* which must be updated.
*
*******************************************************************************/
static void Analog_UpdateTimerTable_AC(uint8_t stateIdx, const cy_stc_autanalog_stt_t * stateTransitionTable, uint8_t targetState)
{
    if (NULL != stateTransitionTable[stateIdx].ac)
    {
        uint32_t regVal;

        AUTANALOG_AC_TT_CFG0(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG0_DOUT_UNLOCK_Msk;
        AUTANALOG_AC_TT_CFG0(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG0_DOUT_Msk;
        AUTANALOG_AC_TT_CFG0(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG0_MODE_Msk;
        AUTANALOG_AC_TT_CFG0(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG0_MODE_UNLOCK_Msk;
        AUTANALOG_AC_TT_CFG0(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG0_PRB_UNLOCK_Msk;
        AUTANALOG_AC_TT_CFG0(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG0_CTBL0_UNLOCK_Msk;
        AUTANALOG_AC_TT_CFG0(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG0_CTBL1_UNLOCK_Msk;
        AUTANALOG_AC_TT_CFG0(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG0_PTC_UNLOCK_Msk;
        AUTANALOG_AC_TT_CFG0(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG0_DAC0_UNLOCK_Msk;
        AUTANALOG_AC_TT_CFG0(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG0_DAC1_UNLOCK_Msk;
        AUTANALOG_AC_TT_CFG0(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG0_SAR_UNLOCK_Msk;

        CY_ASSERT_L3(AUTANALOG_STT_AC_CFG0_DOUT(stateTransitionTable[stateIdx].ac->gpioOut));

        regVal =
            _BOOL2FLD(ACTRLR_TTCFG_TT_CFG0_DOUT_UNLOCK, stateTransitionTable[stateIdx].ac->unlockGpioOut) |
            _VAL2FLD(ACTRLR_TTCFG_TT_CFG0_DOUT, stateTransitionTable[stateIdx].ac->gpioOut) |
            _BOOL2FLD(ACTRLR_TTCFG_TT_CFG0_MODE, stateTransitionTable[stateIdx].ac->lpMode) |
            _VAL2FLD(ACTRLR_TTCFG_TT_CFG0_MODE_UNLOCK, stateTransitionTable[stateIdx].ac->unlock);

#if !defined (CY_AUTANALOG_PRB_DISABLE)
        if (NULL != stateTransitionTable[stateIdx].prb)
        {
            regVal |= _VAL2FLD(ACTRLR_TTCFG_TT_CFG0_PRB_UNLOCK, stateTransitionTable[stateIdx].prb->unlock);
        }
#endif

#if defined (CY_IP_MXS22LPPASS_CTB) && !defined (CY_AUTANALOG_CTB_DISABLE)
        for (uint8_t devIdx = 0U; devIdx < PASS_NR_CTBLS; devIdx++)
        {
#ifndef CTBL0_BASE
            if (0U == devIdx)
            {
                continue;
            }
#endif
#ifndef CTBL1_BASE
            if (1U == devIdx)
            {
                continue;
            }
#endif
            if (NULL != stateTransitionTable[stateIdx].ctb[devIdx])
            {
                regVal |= (0U == devIdx) ?
                          _VAL2FLD(ACTRLR_TTCFG_TT_CFG0_CTBL0_UNLOCK, stateTransitionTable[stateIdx].ctb[devIdx]->unlock) :
                          _VAL2FLD(ACTRLR_TTCFG_TT_CFG0_CTBL1_UNLOCK, stateTransitionTable[stateIdx].ctb[devIdx]->unlock);
            }
        }
#endif

#if defined (CY_IP_MXS22LPPASS_PTC) && !defined (CY_AUTANALOG_PTC_DISABLE)
#if defined(PTC_BASE)
        if (NULL != stateTransitionTable[stateIdx].ptcomp[0U])
        {
            regVal |= _VAL2FLD(ACTRLR_TTCFG_TT_CFG0_PTC_UNLOCK, stateTransitionTable[stateIdx].ptcomp[0U]->unlock);
        }
#endif
#endif

#if defined (CY_IP_MXS22LPPASS_DAC) && !defined (CY_AUTANALOG_DAC_DISABLE)
        for (uint8_t devIdx = 0U; devIdx < PASS_NR_DACS; devIdx++)
        {
#ifndef DAC0_BASE
            if (0U == devIdx)
            {
                continue;
            }
#endif
#ifndef DAC1_BASE
            if (1U == devIdx)
            {
                continue;
            }
#endif
            if (NULL != stateTransitionTable[stateIdx].dac[devIdx])
            {
                regVal |= (0U == devIdx) ?
                          _VAL2FLD(ACTRLR_TTCFG_TT_CFG0_DAC0_UNLOCK, stateTransitionTable[stateIdx].dac[devIdx]->unlock) :
                          _VAL2FLD(ACTRLR_TTCFG_TT_CFG0_DAC1_UNLOCK, stateTransitionTable[stateIdx].dac[devIdx]->unlock);
            }
        }
#endif

#if defined (CY_IP_MXS22LPPASS_SAR) && !defined (CY_AUTANALOG_SAR_DISABLE)
#if defined(SAR_BASE)
        if (NULL != stateTransitionTable[stateIdx].sar[0U])
        {
            regVal |= _VAL2FLD(ACTRLR_TTCFG_TT_CFG0_SAR_UNLOCK, stateTransitionTable[stateIdx].sar[0U]->unlock);
        }
#endif
#endif

        AUTANALOG_AC_TT_CFG0(ACTRLR_BASE, targetState) |= regVal;

