PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_autanalog.c
        /* AUTANALOG_AC_TT_CFG1 */
        CY_ASSERT_L3(AUTANALOG_STT_AC_CFG1_CNT(stateTransitionTable[stateIdx].ac->count));
        CY_ASSERT_L3(AUTANALOG_STT_AC_CFG1_ACTION(stateTransitionTable[stateIdx].ac->action));
        CY_ASSERT_L3(AUTANALOG_STT_AC_CFG1_COND(stateTransitionTable[stateIdx].ac->condition));
        CY_ASSERT_L3(AUTANALOG_STT_AC_CFG1_BR_ADDR(stateTransitionTable[stateIdx].ac->branchState));

        regVal =
            _VAL2FLD(ACTRLR_TTCFG_TT_CFG1_CNT, stateTransitionTable[stateIdx].ac->count) |
            _VAL2FLD(ACTRLR_TTCFG_TT_CFG1_ACTION, stateTransitionTable[stateIdx].ac->action) |
            _VAL2FLD(ACTRLR_TTCFG_TT_CFG1_COND, stateTransitionTable[stateIdx].ac->condition) |
            _VAL2FLD(ACTRLR_TTCFG_TT_CFG1_BR_ADDR, stateTransitionTable[stateIdx].ac->branchState) |
            _VAL2FLD(ACTRLR_TTCFG_TT_CFG1_INTR_SET, stateTransitionTable[stateIdx].ac->trigInt);

        AUTANALOG_AC_TT_CFG1(ACTRLR_BASE, targetState) = regVal;
    }
}


#if !defined (CY_AUTANALOG_PRB_DISABLE)
/*******************************************************************************
* Function Name: Analog_UpdateTimerTable_PRB
****************************************************************************//**
*
* Used to update a particular state in the State Transition Table for the PRB subsystem.
*
* \param stateIdx
* Defines the state in the State Transition Table to update the PRB subsystem.
*
* \param stateTransitionTable
* Pointer to array containing new set of configuration data for State Transition Table,
* which must be updated.
*
*******************************************************************************/
static void Analog_UpdateTimerTable_PRB(uint8_t stateIdx, const cy_stc_autanalog_stt_t * stateTransitionTable, uint8_t targetState)
{
    if (NULL != stateTransitionTable[stateIdx].prb)
    {
        uint32_t regVal;

        /* AUTANALOG_AC_TT_CFG4 */
        CY_ASSERT_L3(AUTANALOG_PRB_VREF_CTRL_VAL(stateTransitionTable[stateIdx].prb->prbVref0Tap));
        CY_ASSERT_L3(AUTANALOG_PRB_VREF_CTRL_VAL(stateTransitionTable[stateIdx].prb->prbVref1Tap));

        regVal =
            _VAL2FLD(ACTRLR_TTCFG_TT_CFG4_PRB_VREF0_FW_MODE, stateTransitionTable[stateIdx].prb->prbVref0Fw) |
            _VAL2FLD(ACTRLR_TTCFG_TT_CFG4_PRB_VREF0_VAL, stateTransitionTable[stateIdx].prb->prbVref0Tap) |
            _VAL2FLD(ACTRLR_TTCFG_TT_CFG4_PRB_VREF1_FW_MODE, stateTransitionTable[stateIdx].prb->prbVref1Fw) |
            _VAL2FLD(ACTRLR_TTCFG_TT_CFG4_PRB_VREF1_VAL, stateTransitionTable[stateIdx].prb->prbVref1Tap);

        AUTANALOG_AC_TT_CFG4(ACTRLR_BASE, targetState) = regVal;
    }
}
#endif


/* Two instances of the CTB are currently supported */
#if defined (CY_IP_MXS22LPPASS_CTB) && !defined (CY_AUTANALOG_CTB_DISABLE)
/*******************************************************************************
* Function Name: Analog_UpdateTimerTable_CTB
****************************************************************************//**
*
* Used to update a particular state in the State Transition Table for the CTB subsystem.
*
* \param stateIdx
* Defines the state in the State Transition Table for update of the CTB subsystem.
*
* \param stateTransitionTable
* Pointer to array containing new set of configuration data for State Transition Table,
* which must be updated.
*
*******************************************************************************/
static void Analog_UpdateTimerTable_CTB(uint8_t stateIdx, const cy_stc_autanalog_stt_t * stateTransitionTable, uint8_t targetState)
{
    uint8_t devIdx;
    uint32_t regVal;

    for (devIdx = 0U; devIdx < PASS_NR_CTBLS; devIdx++)
    {
#ifndef CTBL0_BASE
        if (0U == devIdx)
        {
            continue;
        }
#endif
#ifndef CTBL1_BASE
        if (1U == devIdx)
        {
            continue;
        }
#endif
        if (NULL != stateTransitionTable[stateIdx].ctb[devIdx])
        {
            /* AUTANALOG_AC_TT_CFG2 */
            CY_ASSERT_L3(AUTANALOG_STT_CTB_CFG(stateTransitionTable[stateIdx].ctb[devIdx]->cfgOpamp0));
            CY_ASSERT_L3(AUTANALOG_STT_CTB_GAIN(stateTransitionTable[stateIdx].ctb[devIdx]->gainOpamp0));
            CY_ASSERT_L3(AUTANALOG_STT_CTB_CFG(stateTransitionTable[stateIdx].ctb[devIdx]->cfgOpamp1));
            CY_ASSERT_L3(AUTANALOG_STT_CTB_GAIN(stateTransitionTable[stateIdx].ctb[devIdx]->gainOpamp1));

            if (0U == devIdx)
            {
                /* CTB0 */
                AUTANALOG_AC_TT_CFG2(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG2_CTBL0_OA0_EN_Msk;
                AUTANALOG_AC_TT_CFG2(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG2_CTBL0_OA0_CFG_Msk;
                AUTANALOG_AC_TT_CFG2(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG2_CTBL0_OA0_GAIN_Msk;
                AUTANALOG_AC_TT_CFG2(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG2_CTBL0_OA1_EN_Msk;
                AUTANALOG_AC_TT_CFG2(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG2_CTBL0_OA1_CFG_Msk;
                AUTANALOG_AC_TT_CFG2(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG2_CTBL0_OA1_GAIN_Msk;
            }
            else
            {
                /* CTB1 */
                AUTANALOG_AC_TT_CFG2(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG2_CTBL1_OA0_EN_Msk;
                AUTANALOG_AC_TT_CFG2(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG2_CTBL1_OA0_CFG_Msk;
                AUTANALOG_AC_TT_CFG2(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG2_CTBL1_OA0_GAIN_Msk;
                AUTANALOG_AC_TT_CFG2(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG2_CTBL1_OA1_EN_Msk;
                AUTANALOG_AC_TT_CFG2(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG2_CTBL1_OA1_CFG_Msk;
                AUTANALOG_AC_TT_CFG2(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG2_CTBL1_OA1_GAIN_Msk;
            }

            regVal = (0U == devIdx) ?
                     /* CTB0 */
                     _VAL2FLD(ACTRLR_TTCFG_TT_CFG2_CTBL0_OA0_EN, stateTransitionTable[stateIdx].ctb[devIdx]->enableOpamp0) |
                     _VAL2FLD(ACTRLR_TTCFG_TT_CFG2_CTBL0_OA0_CFG, stateTransitionTable[stateIdx].ctb[devIdx]->cfgOpamp0) |
                     _VAL2FLD(ACTRLR_TTCFG_TT_CFG2_CTBL0_OA0_GAIN, stateTransitionTable[stateIdx].ctb[devIdx]->gainOpamp0) |
                     _VAL2FLD(ACTRLR_TTCFG_TT_CFG2_CTBL0_OA1_EN, stateTransitionTable[stateIdx].ctb[devIdx]->enableOpamp1) |
                     _VAL2FLD(ACTRLR_TTCFG_TT_CFG2_CTBL0_OA1_CFG, stateTransitionTable[stateIdx].ctb[devIdx]->cfgOpamp1) |
                     _VAL2FLD(ACTRLR_TTCFG_TT_CFG2_CTBL0_OA1_GAIN, stateTransitionTable[stateIdx].ctb[devIdx]->gainOpamp1) :
                     /* CTB1 */
                     _VAL2FLD(ACTRLR_TTCFG_TT_CFG2_CTBL1_OA0_EN, stateTransitionTable[stateIdx].ctb[devIdx]->enableOpamp0) |
                     _VAL2FLD(ACTRLR_TTCFG_TT_CFG2_CTBL1_OA0_CFG, stateTransitionTable[stateIdx].ctb[devIdx]->cfgOpamp0) |
                     _VAL2FLD(ACTRLR_TTCFG_TT_CFG2_CTBL1_OA0_GAIN, stateTransitionTable[stateIdx].ctb[devIdx]->gainOpamp0) |
                     _VAL2FLD(ACTRLR_TTCFG_TT_CFG2_CTBL1_OA1_EN, stateTransitionTable[stateIdx].ctb[devIdx]->enableOpamp1) |
                     _VAL2FLD(ACTRLR_TTCFG_TT_CFG2_CTBL1_OA1_CFG, stateTransitionTable[stateIdx].ctb[devIdx]->cfgOpamp1) |
                     _VAL2FLD(ACTRLR_TTCFG_TT_CFG2_CTBL1_OA1_GAIN, stateTransitionTable[stateIdx].ctb[devIdx]->gainOpamp1);

