PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_autanalog.c
            AUTANALOG_AC_TT_CFG2(ACTRLR_BASE, targetState) |= regVal;
        }
    }
#if !defined (CTBL0_BASE) && !defined (CTBL1_BASE)
    (void) stateIdx;
    (void) stateTransitionTable;
    (void) targetState;
    (void) regVal;
#endif
}
#endif


/* One instance of the PTComp is currently supported */
#if defined (CY_IP_MXS22LPPASS_PTC) && !defined (CY_AUTANALOG_PTC_DISABLE)
/*******************************************************************************
* Function Name: Analog_UpdateTimerTable_PTC
****************************************************************************//**
*
* Used to update a particular state in the State Transition Table for the PTComp subsystem.
*
* \param stateIdx
* Defines the state in the State Transition Table to update the PTComp subsystem.
*
* \param stateTransitionTable
* Pointer to array containing new set of configuration data for State Transition Table,
* which must be updated.
*
*******************************************************************************/
static void Analog_UpdateTimerTable_PTC(uint8_t stateIdx, const cy_stc_autanalog_stt_t * stateTransitionTable, uint8_t targetState)
{
    uint32_t regVal;

#if defined(PTC_BASE)
    if (NULL != stateTransitionTable[stateIdx].ptcomp[0U])
    {
        /* AUTANALOG_AC_TT_CFG3 */
        AUTANALOG_AC_TT_CFG3(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG3_PTC_CMP0_EN_Msk;
        AUTANALOG_AC_TT_CFG3(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG3_PTC_CMP0_CFG_Msk;
        AUTANALOG_AC_TT_CFG3(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG3_PTC_CMP1_EN_Msk;
        AUTANALOG_AC_TT_CFG3(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG3_PTC_CMP1_CFG_Msk;

        CY_ASSERT_L3(AUTANALOG_STT_PTCOMP_CFG(stateTransitionTable[stateIdx].ptcomp[0U]->dynCfgIdxComp0));
        CY_ASSERT_L3(AUTANALOG_STT_PTCOMP_CFG(stateTransitionTable[stateIdx].ptcomp[0U]->dynCfgIdxComp1));

        regVal =
            _VAL2FLD(ACTRLR_TTCFG_TT_CFG3_PTC_CMP0_EN, stateTransitionTable[stateIdx].ptcomp[0U]->enableComp0) |
            _VAL2FLD(ACTRLR_TTCFG_TT_CFG3_PTC_CMP0_CFG, stateTransitionTable[stateIdx].ptcomp[0U]->dynCfgIdxComp0) |
            _VAL2FLD(ACTRLR_TTCFG_TT_CFG3_PTC_CMP1_EN, stateTransitionTable[stateIdx].ptcomp[0U]->enableComp1) |
            _VAL2FLD(ACTRLR_TTCFG_TT_CFG3_PTC_CMP1_CFG, stateTransitionTable[stateIdx].ptcomp[0U]->dynCfgIdxComp1);

        AUTANALOG_AC_TT_CFG3(ACTRLR_BASE, targetState) |= regVal;
    }
#else
    (void) stateIdx;
    (void) stateTransitionTable;
    (void) targetState;
    (void) regVal;
#endif
}
#endif


/* Two instances of the DAC are currently supported */
#if defined (CY_IP_MXS22LPPASS_DAC) && !defined (CY_AUTANALOG_DAC_DISABLE)
/*******************************************************************************
* Function Name: Analog_UpdateTimerTable_DAC
****************************************************************************//**
*
* Used to update a particular state in the State Transition Table for the DAC subsystem.
*
* \param stateIdx
* Defines the state in the State Transition Table for update of the DAC subsystem.
*
* \param stateTransitionTable
* Pointer to array containing new set of configuration data for State Transition Table,
* which must be updated.
*
*******************************************************************************/
static void Analog_UpdateTimerTable_DAC(uint8_t stateIdx, const cy_stc_autanalog_stt_t * stateTransitionTable, uint8_t targetState)
{
    uint8_t devIdx;
    uint32_t regVal;
    uint32_t direction;

    for (devIdx = 0U; devIdx < PASS_NR_DACS; devIdx++)
    {
#ifndef DAC0_BASE
        if (0U == devIdx)
        {
            continue;
        }
#endif
#ifndef DAC1_BASE
        if (1U == devIdx)
        {
            continue;
        }
#endif
        if (NULL != stateTransitionTable[stateIdx].dac[devIdx])
        {
            direction = 0U;

            /* AUTANALOG_AC_TT_CFG3 */
            CY_ASSERT_L3(AUTANALOG_STT_DAC_CHANNEL(stateTransitionTable[stateIdx].dac[devIdx]->channel));
            CY_ASSERT_L3(AUTANALOG_STT_DAC_DIRECTION(stateTransitionTable[stateIdx].dac[devIdx]->direction));

            if (0U == devIdx)
            {
                /* DAC0 */
                AUTANALOG_AC_TT_CFG3(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG3_DAC0_EN_Msk;
                AUTANALOG_AC_TT_CFG3(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG3_DAC0_CHANNEL_Msk;
                AUTANALOG_AC_TT_CFG3(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG3_DAC0_INC_Msk;
                AUTANALOG_AC_TT_CFG3(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG3_DAC0_DEC_Msk;
                AUTANALOG_AC_TT_CFG3(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG3_DAC0_TR_Msk;
            }
            else
            {
                /* DAC1 */
                AUTANALOG_AC_TT_CFG3(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG3_DAC1_EN_Msk;
                AUTANALOG_AC_TT_CFG3(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG3_DAC1_CHANNEL_Msk;
                AUTANALOG_AC_TT_CFG3(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG3_DAC1_INC_Msk;
                AUTANALOG_AC_TT_CFG3(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG3_DAC1_DEC_Msk;
                AUTANALOG_AC_TT_CFG3(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG3_DAC1_TR_Msk;
            }

            if (stateTransitionTable[stateIdx].dac[devIdx]->direction != CY_AUTANALOG_DAC_DIRECTION_DISABLED)
            {
                direction = (0U == devIdx) ?
                            /* DAC0 */
                            (stateTransitionTable[stateIdx].dac[devIdx]->direction == CY_AUTANALOG_DAC_DIRECTION_FORWARD ?
                             ACTRLR_TTCFG_TT_CFG3_DAC0_INC_Msk :
                             ACTRLR_TTCFG_TT_CFG3_DAC0_DEC_Msk) :
                            /* DAC1 */
                            (stateTransitionTable[stateIdx].dac[devIdx]->direction == CY_AUTANALOG_DAC_DIRECTION_FORWARD ?
                             ACTRLR_TTCFG_TT_CFG3_DAC1_INC_Msk :
                             ACTRLR_TTCFG_TT_CFG3_DAC1_DEC_Msk);
            }

            regVal = (0U == devIdx) ?
                     /* DAC0 */
                     _VAL2FLD(ACTRLR_TTCFG_TT_CFG3_DAC0_EN, stateTransitionTable[stateIdx].dac[devIdx]->enable) |
                     _VAL2FLD(ACTRLR_TTCFG_TT_CFG3_DAC0_CHANNEL, stateTransitionTable[stateIdx].dac[devIdx]->channel) |
                     direction |
                     _VAL2FLD(ACTRLR_TTCFG_TT_CFG3_DAC0_TR, stateTransitionTable[stateIdx].dac[devIdx]->trigger) :
                     /* DAC1 */
                     _VAL2FLD(ACTRLR_TTCFG_TT_CFG3_DAC1_EN, stateTransitionTable[stateIdx].dac[devIdx]->enable) |
                     _VAL2FLD(ACTRLR_TTCFG_TT_CFG3_DAC1_CHANNEL, stateTransitionTable[stateIdx].dac[devIdx]->channel) |
                     direction |
                     _VAL2FLD(ACTRLR_TTCFG_TT_CFG3_DAC1_TR, stateTransitionTable[stateIdx].dac[devIdx]->trigger);

            AUTANALOG_AC_TT_CFG3(ACTRLR_BASE, targetState) |= regVal;
        }
    }
#if !defined (DAC0_BASE) && !defined (DAC1_BASE)
    (void) stateIdx;
    (void) stateTransitionTable;
    (void) targetState;
    (void) regVal;
    (void) direction;
#endif
}
#endif


