PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_autanalog.c
/* One instance of the SAR is currently supported */
#if defined (CY_IP_MXS22LPPASS_SAR) && !defined (CY_AUTANALOG_SAR_DISABLE)
/*******************************************************************************
* Function Name: Analog_UpdateTimerTable_SAR
****************************************************************************//**
*
* Used to update a particular state in the State Transition Table for the SAR subsystem.
*
* \param stateIdx
* Defines the state in the State Transition Table to update the SAR subsystem.
*
* \param stateTransitionTable
* Pointer to array containing new set of configuration data for State Transition Table,
* which must be updated.
*
*******************************************************************************/
static void Analog_UpdateTimerTable_SAR(uint8_t stateIdx, const cy_stc_autanalog_stt_t * stateTransitionTable, uint8_t targetState)
{
    uint32_t regVal;

#if defined(SAR_BASE)
    if (NULL != stateTransitionTable[stateIdx].sar[0U])
    {
        /* AUTANALOG_AC_TT_CFG3 */
        AUTANALOG_AC_TT_CFG3(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG3_SAR_ENTRY_ADDR_Msk;
        AUTANALOG_AC_TT_CFG3(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG3_SAR_TR_Msk;
        AUTANALOG_AC_TT_CFG3(ACTRLR_BASE, targetState) &= ~ACTRLR_TTCFG_TT_CFG3_SAR_EN_Msk;

        CY_ASSERT_L3(AUTANALOG_STT_SAR_STATE(stateTransitionTable[stateIdx].sar[0U]->entryState));

        regVal =
            _VAL2FLD(ACTRLR_TTCFG_TT_CFG3_SAR_ENTRY_ADDR, stateTransitionTable[stateIdx].sar[0U]->entryState) |
            _VAL2FLD(ACTRLR_TTCFG_TT_CFG3_SAR_TR, stateTransitionTable[stateIdx].sar[0U]->trigger) |
            _VAL2FLD(ACTRLR_TTCFG_TT_CFG3_SAR_EN, stateTransitionTable[stateIdx].sar[0U]->enable);

        AUTANALOG_AC_TT_CFG3(ACTRLR_BASE, targetState) |= regVal;
    }
#else
    (void) stateIdx;
    (void) stateTransitionTable;
    (void) targetState;
    (void) regVal;
#endif
}
#endif

#endif /* CY_IP_MXS22LPPASS */

/* [] END OF FILE */
